### Question 1

Run the Docker container with the python:3.13 image:
```Bash
    docker run -it --entrypoint=bash --rm python:3.13
```

Check the pip version once inside the container:
```Bash
    pip --version
```

It returns:
    `pip 25.3 from /usr/local/lib/python3.13/site-packages/pip (python 3.13)`

Exit the container:
```Bash
    exit
```
So the answer is **25.3**

### Question 2
The answer is **db:5432** and **postgres:5432**

### Prepare the data and database

```Bash
wget https://d37ci6vzurychx.cloudfront.net/trip-data/green_tripdata_2025-11.parquet
wget https://github.com/DataTalksClub/nyc-tlc-data/releases/download/misc/taxi_zone_lookup.csv
```

Run the postgres and pgadmin containers with docker-compose.yaml:
```Bash
    docker compose up
```

### Prepare the virtual environment

Install uv:
```Bash
    pip install uv
```
Initialize python and add dependencies:
```Bash
    uv init --python=3.13
    uv add pandas pyarrow sqlalchemy psycopg2-binary tqdm
```

### Load the data to database

In [1]:
import pandas as pd
import pyarrow.parquet as pq
from sqlalchemy import create_engine
from tqdm.auto import tqdm

/workspaces/Jessie-DEzoomcamp-2026/homework/module1-homework/.venv/lib/python3.13/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [2]:
# Connect the database
engine = create_engine('postgresql://postgres:postgres@localhost:5433/ny_taxi')
engine.connect()

In [3]:
file_name_p = "green_tripdata_2025-11.parquet"
file_name_c = "taxi_zone_lookup.csv"

file_p = pq.ParquetFile(file_name_p)
df_c = pd.read_csv(file_name_c)

In [4]:
# Test reading parquet file in batches
df_p = next(file_p.iter_batches(batch_size=10)).to_pandas()
display(df_p)

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,...,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge,cbd_congestion_fee
0,2,2025-11-01 00:34:48,2025-11-01 00:41:39,N,1,74,42,1,0.74,7.2,...,0.5,1.94,0.0,NaN,1.0,11.64,1,1,0.00,0.00
1,2,2025-11-01 00:18:52,2025-11-01 00:24:27,N,1,74,42,2,0.95,7.2,...,0.5,0.00,0.0,NaN,1.0,9.70,2,1,0.00,0.00
2,2,2025-11-01 01:03:14,2025-11-01 01:15:24,N,1,83,160,1,2.19,13.5,...,0.5,5.00,0.0,NaN,1.0,21.00,1,1,0.00,0.00
3,2,2025-11-01 00:10:57,2025-11-01 00:24:53,N,1,166,127,1,5.44,24.7,...,0.5,0.50,0.0,NaN,1.0,27.70,1,1,0.00,0.00
4,1,2025-11-01 00:03:48,2025-11-01 00:19:38,N,1,166,262,1,3.20,18.4,...,1.5,1.00,0.0,NaN,1.0,24.65,1,1,2.75,0.00
5,1,2025-11-01 00:42:13,2025-11-01 01:04:50,N,1,112,48,2,5.10,26.8,...,1.5,6.55,0.0,NaN,1.0,39.35,1,1,2.75,0.75
6,2,2025-11-01 00:05:41,2025-11-01 00:39:20,N,1,83,87,1,9.80,43.6,...,0.5,9.92,0.0,NaN,1.0,59.52,1,1,2.75,0.75
7,2,2025-11-01 00:42:14,2025-11-01 01:13:20,N,1,66,233,1,5.01,28.9,...,0.5,6.98,0.0,NaN,1.0,41.88,1,1,2.75,0.75
8,2,2025-11-01 00:03:08,2025-11-01 00:06:27,N,1,223,223,1,0.63,5.1,...,0.5,1.52,0.0,NaN,1.0,9.12,1,1,0.00,0.00
9,2,2025-11-01 00:56:33,2025-11-01 01:01:34,N,1,130,130,1,1.15,7.9,...,0.5,0.00,0.0,NaN,1.0,10.40,2,1,0.00,0.00

In [5]:
display(df_c)

     LocationID        Borough                     Zone service_zone
0             1            EWR           Newark Airport          EWR
1             2         Queens              Jamaica Bay    Boro Zone
2             3          Bronx  Allerton/Pelham Gardens    Boro Zone
3             4      Manhattan            Alphabet City  Yellow Zone
4             5  Staten Island            Arden Heights    Boro Zone
..          ...            ...                      ...          ...
260         261      Manhattan       World Trade Center  Yellow Zone
261         262      Manhattan           Yorkville East  Yellow Zone
262         263      Manhattan           Yorkville West  Yellow Zone
263         264        Unknown                       NV          NaN
264         265        Unknown                      NaN          NaN

[265 rows x 4 columns]

In [6]:
df_p_iter = file_p.iter_batches(batch_size=10000)

In [7]:
# Load parquet data into Postgres in chunks
count = 0
for batch in tqdm(df_p_iter):

    batch_df = batch.to_pandas()

    # Create table header
    if count == 0:
        batch_df.head(0).to_sql(name='green_tripdata', con=engine, if_exists='replace')
    batch_df.to_sql(name='green_tripdata', con=engine, if_exists='append')
    count += 1
    print(f"  Inserted batch {count}")

# Load CSV data into Postgres
df_c.to_sql(name='taxi_zone_lookup', con=engine, if_exists='replace')

print("Data has been loaded into Postgres database.")

1it [00:00,  1.07it/s]

  Inserted batch 1

2it [00:01,  1.12it/s]

  Inserted batch 2

3it [00:02,  1.10it/s]

  Inserted batch 3

4it [00:03,  1.09it/s]

  Inserted batch 4

5it [00:04,  1.18it/s]

  Inserted batch 5
Data has been loaded into Postgres database.

### Question 3

In [8]:
query = """
SELECT count(*) 
from green_tripdata
WHERE trip_distance <= 1 and 
trip_distance is not null and
lpep_pickup_datetime >= '2025-11-01' and
lpep_pickup_datetime < '2025-12-01'
"""

pd.read_sql(query, con=engine)

   count
0   8007

### Question 4

In [9]:
query = """
SELECT DATE(lpep_pickup_datetime) as pickup_date 
FROM green_tripdata
WHERE trip_distance = (
    SELECT MAX(trip_distance)  
    FROM green_tripdata
    WHERE trip_distance < 100 and trip_distance is not null 
)
"""

pd.read_sql(query, con=engine)

  pickup_date
0  2025-11-14

### Question 5

In [10]:
query = """
select "Zone"
from green_tripdata g join taxi_zone_lookup t
on g."PULocationID" = t."LocationID"
where lpep_pickup_datetime::DATE = '2025-11-18'
group by "Zone"
order by sum(total_amount) desc
limit 1;
"""

pd.read_sql(query, con=engine)

                Zone
0  East Harlem North

### Question 6

In [11]:
query = """
select t2."Zone" dozone
from  green_tripdata g
join taxi_zone_lookup t1 on g."PULocationID" = t1."LocationID" 
join taxi_zone_lookup t2 on g."DOLocationID" = t2."LocationID"
where lpep_pickup_datetime >= '2025-11-01' 
and lpep_pickup_datetime < '2025-12-01'
and t1."Zone"='East Harlem North'
order by tip_amount desc
limit 1;
"""

pd.read_sql(query, con=engine)

           dozone
0  Yorkville West

### Question 7


1. Downloading the provider plugins and setting up backend
    
    ```teraform init```

2. Generating proposed changes and auto-executing the plan

    ```terraform apply -auto-approve```

3. Remove all resources managed by terraform

    ```terraform destroy```